{
  "metadata": {
    "title": "Why Strength Training & Combat Sports Are Essential for Every Man",
    "slug": "strength-training-combat-sports-essential",
    "summary": "Strength training and combat sports are not just about getting stronger—they delay aging, even reversing aspects of it. Most men start decaying in their late 20's to early 30's, losing muscle mass, strength, and testosterone while gaining love handles. But if you train, you separate yourself from your peers. While they decline, you’re still peaking, maintaining strength and youthful beauty far beyond them. More than that, these disciplines force you to break the mental limits of who you think you are. Every time you push past what felt impossible, your ego is forced to expand, integrating deeper parts of yourself into your identity. And beyond both body and mind, training reconnects you with the masculine aspects of your nature that modern society suppresses. Strength, aggression, dominance, sexual drive, and the longing for real experience—these aren’t weaknesses, they’re part of you. You need to train to stay in touch with them. Neglect them, and you won’t eliminate them—you’ll suppress them, letting them control you from the shadows instead of harnessing them as your own.",
    "author": "Björn van der Lugt",
    "category": "Fitness",
    "tags": [
      "Individuation",
      "Starting Out"
    ],
    "readingTime": "4 min",
    "sources": [
      {
        "title": "Resistance Training and the Preservation of Muscle Mass in Aging Adults",
        "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6119844/",
        "description": "A meta-analysis of 49 studies showing how progressive resistance training prevents age-related muscle loss and increases lean body mass in older men."
      },
      {
        "title": "Testosterone and Aging: Clinical Research on Decline and Effects",
        "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9605266/",
        "description": "Study analyzing the natural decline of testosterone (1-2% per year) and its impact on muscle loss, strength, and overall health in aging men."
      },
      {
        "title": "Preserve Your Muscle Mass With Strength Training",
        "url": "https://www.health.harvard.edu/staying-healthy/preserve-your-muscle-mass",
        "description": "Harvard Health article detailing the role of strength training in maintaining muscle mass and slowing the effects of aging."
      }
    ],
    "featuredImage": {
      "src": "/images/art/lion-libre-lumineux-victor-brauner-1949.webp",
      "alt": "A surrealist painting of a green lion-like creature with a human face and an embryo on its back, set against a mysterious architectural backdrop. The text 'Lion Libre Lumineux' is inscribed below."
    },
    "createdAt": "2025-02-25T06:29:37.101422Z"
  },
  "article": {
    "sections": [
      {
        "content": [
          {
            "type": "image",
            "image": [
              {
                "src": "/images/art/lion-libre-lumineux-victor-brauner-1949.webp",
                "alt": "A surrealist painting of a green lion-like creature with a human face and an embryo on its back, set against a mysterious architectural backdrop. The text 'Lion Libre Lumineux' is inscribed below.",
                "aspectRatio": "1.42",
                "caption": "'Lion Libre Lumineux' (1949) by Victor Brauner—an enigmatic fusion of human and animal, embodying themes of transformation, instinct, and the unconscious."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "I’d like everyone to stop thinking of fitness and combat sports as optional hobbies and start seeing them as fundamental for any man looking to assert himself in the world. Now more than ever, the world needs men who apply themselves fully—men who operate from a place of true individuation."
          },
          {
            "type": "paragraph",
            "text": "If you're open-minded enough to bear with me—and not too afraid of taking action should you find truth in my words—let’s dive into why physical fitness is not just an option, but essential."
          }
        ]
      },
      {
        "content": [
          {
            "type": "heading",
            "text": "How Strength Training Slows Aging & Boosts Longevity"
          },
          {
            "type": "image",
            "image": [
              {
                "src": "/images/art/the-fountain-of-youth-lucas-cranach-the-elder-1546.webp",
                "alt": "A Renaissance painting depicting an elaborate fountain where elderly people enter, bathe in the waters, and emerge rejuvenated. The scene is filled with figures in various states of undress, engaging in activities symbolizing youth and vitality.",
                "aspectRatio": "1.5",
                "caption": "The Fountain of Youth (1546) by Lucas Cranach the Elder, illustrating the mythical rejuvenating powers of a miraculous water source."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "After the age of 30, men begin losing 3-8% of muscle mass (sarcopenia) per decade and approximately 2-3% of free testosterone per year if they let themselves go. However, studies consistently show that this decline can be significantly slowed—or even halted—through resistance and cardio training. The benefits of consistent training are well-documented and can be roughly quantified as follows:"
          },
          {
            "type": "list",
            "list": {
              "items": [
                "Cellular Aging & Telomeres – Strength training has been linked to longer telomeres, the protective DNA caps associated with biological youthfulness.",
                "Strength Training Increases Testosterone & Prevents Hormonal Decline – Regular training increases testosterone, IGF-1, and growth hormone, effectively counteracting the hormonal decline of aging.",
                "Bone Density – Lifting prevents osteoporosis and fractures, which are major factors in aging well and maintaining mobility.",
                "Mitochondrial Health – Strength training improves mitochondrial efficiency, making cells more energy-efficient and reducing oxidative stress—a key driver of aging.",
                "Biological Age Reduction – Studies suggest regular cardio can make your biological age up to 10 years younger by improving heart function, VO2 max, and circulation.",
                "Mitochondrial Biogenesis – Cardio enhances mitochondrial biogenesis, improving cellular energy and longevity, helping your cells function more like they did in your younger years.",
                "Telomere Preservation – Like strength training, cardio helps preserve telomeres, further slowing cellular aging.",
                "Inflammation Reduction – Chronic inflammation is a key driver of aging, and cardio significantly lowers C-reactive protein (CRP) and other inflammatory markers."
              ],
              "ordered": false
            }
          },
          {
            "type": "heading",
            "level": 3,
            "text": "How Much Slower Do You Age?"
          },
          {
            "type": "paragraph",
            "text": "Scientific research has quantified the impact of training on biological aging:"
          },
          {
            "type": "list",
            "list": {
              "items": [
                "Regular strength training (2-3x per week) can reduce biological aging markers by 5-10 years.",
                "Consistent cardio (150-300 minutes per week) can extend lifespan by 5-10 years and reduce all-cause mortality by 30-50%.",
                "Strength + Cardio Combined produces the most potent anti-aging effects, reducing biological age by 7-15 years, depending on consistency and intensity."
              ],
              "ordered": false
            }
          },
          {
            "type": "paragraph",
            "text": "It may not seem like much now, but over time, these benefits stack, separating you from those who decline. Instead of peaking in your late 20s and declining like the average man, you could hit your prime in your 30s and 40s—while everyone else starts falling apart. Even in your 50s and 60s, you’ll still be strong, capable, and far younger-looking than your peers who neglected their physical development."
          }
        ]
      },
      {
        "content": [
          {
            "type": "heading",
            "text": "Self-Image Transformation & Overcoming Limits"
          },
          {
            "type": "image",
            "image": [
              {
                "src": "/images/art/philosophia_reformata_emblem-9--putrefactio-johan-daniel-mylius-1622.webp",
                "alt": "An alchemical engraving featuring a skeleton holding a raven, standing on a dark orb, flanked by two angels with inscriptions 'Putre' and 'factio.' The background shows a symbolic cosmic landscape with the sun and moon.",
                "aspectRatio": "1.3",
                "caption": "Philosophia Reformata - Emblem 9: Putrefactio (1622) by Johan Daniel Mylius, an alchemical representation of decay and transformation."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "I cannot think of any activity that forces you to reevaluate your self-belief system more consistently than resistance training. Most people are trapped within a fixed perception of themselves, one that dictates who they are and what their limits are. Lifting weights shatters that limiter again and again, constantly pushing it further out."
          },
          {
            "type": "paragraph",
            "text": "To give you an example—under Dutch labor law (Arbowet), the maximum amount of weight a worker is allowed to lift consistently is 25kg. Based on that standard, the idea of lifting 80kg once seemed insane and completely out of reach. Now, I’m deadlifting 200kg. Can you imagine how many times I’ve had to break through what I once thought was impossible? How many times I’ve had to update my self-image to match my new reality?"
          },
          {
            "type": "paragraph",
            "text": "More than just a physical transformation, this becomes a habitual thought pattern—whenever I’m faced with a challenge like this, I instinctively believe that I can do far more than I currently think, as long as I’m willing to let my old self die and be reborn in the process. Through this process, you tap into deeper forces within yourself, beyond the ego. And as the ego rebuilds itself, it integrates aspects of reality that were once beyond its grasp."
          },
          {
            "type": "paragraph",
            "text": "The most important part? This transformation doesn’t stay in the weight room—it transcends into EVERY area of life. That’s why I’d go as far as to say that lifting isn’t just about moving weights. It’s a spiritual endeavor—almost religious in nature."
          }
        ]
      },
      {
        "content": [
          {
            "type": "heading",
            "text": "Beauty, Strength, Longevity"
          },
          {
            "type": "image",
            "image": [
              {
                "src": "/images/art/odilon-redon-the-smiling-spider-1881.webp",
                "alt": "A surreal charcoal drawing of a grotesque spider with an oversized, furry body and a sinister grin, set against a hazy, textured background. The spider’s long, spindly legs stretch across the frame.",
                "aspectRatio": "0.8",
                "caption": "The Smiling Spider (1881) by Odilon Redon, an eerie and dreamlike depiction of an unsettling arachnid."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "I feel like in today’s world, men’s nature is judged and suppressed. Men, by nature, long for the visceral truth of life—we crave real experience, curiosity, violence, aggression, competition, dominance, the drive to impose our will on others, and the urge to fuck."
          },
          {
            "type": "paragraph",
            "text": "Chances are, if you come from the West like me, you’re struggling to access this part of yourself. I truly believe that if you don’t integrate and appreciate this side of yourself, you will turn into a passive-aggressive, effeminate monster who destroys everything around him."
          },
          {
            "type": "paragraph",
            "text": "All of this might seem like a side step, but it’s not. I don’t think there are more concrete and real ways to reconnect with this part of your nature than lifting weights and doing combat sports. And why shouldn't you see the beauty in a strong, well-built, imposing physique? No—that does not make you insecure, no matter what weak people want you to believe."
          }
        ]
      },
      {
        "content": [
          {
            "type": "heading",
            "text": "To Wrap Up"
          },
          {
            "type": "paragraph",
            "text": "Physical fitness is not just fitness. It is not an option, nor a mere hobby. It is a spiritual endeavor—one you must embark on if you want to avoid misery beyond definition and because the people around you actually need you to be at your best."
          }
        ]
      }
    ]
  }
}
  